build/output.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:n1="http://testnamespace/n1" xmlns:n2="http://testnamespace/n2" xmlns:wsse="http://testnamespace/wsse" xmlns:cns="http://testnamespace/cns"><n1:Headers xmls="www.google.com"><n1:session>d62bb29f-595d-4f6d-a05b-fec5a9db08bd</n1:session><n1:token xmls="www.google.com"><wsse:timeCreated>Fri Aug 01 2025 16:09:17 GMT+0530 (India Standard Time)</wsse:timeCreated><wsse:keepAlive>15</wsse:keepAlive><wsse:passWord>pass123</wsse:passWord></n1:token></n1:Headers><n1:Body xmls="www.google.com"><n2:Param1 xmls="www.google.com"><cns:key>key1</cns:key><cns:val>1</cns:val></n2:Param1><n2:Param1><cns:key>key2</cns:key><cns:val>2</cns:val></n2:Param1><n2:Param2><cns:key>key3</cns:key><cns:val>3</cns:val></n2:Param2><n2:Param3>0</n2:Param3></n1:Body></soap:Envelope>